# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11-RepVGG object detection model
# Custom for Jetson Nano (RepC3 backbone & head)

# Parameters
nc: 10  # VisDrone class
scales: # model compound scaling constants, i.e. 'n'
  n: [0.50, 0.25, 1024]

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, RepC3, [128]]       # 2-P3/8
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8 -> P4/16
  - [-1, 1, RepC3, [256]]       # 4-P3/8 (Lưu ý: Index 4 là P3)
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 1, RepC3, [512]]       # 6-P4/16 (Lưu ý: Index 6 là P4)
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 1, RepC3, [1024]]      # 8-P5/32 (Lưu ý: Index 8 là P5)
  - [-1, 1, SPPF, [1024, 5]]    # 9-P5 (Index 9)

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  # [SỬA LỖI] Concat với P4 (Index 6) thay vì index 4 cũ
  - [[-1, 6], 1, Concat, [1]]   # 11 cat backbone P4
  - [-1, 1, RepC3, [512]]       # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  # [SỬA LỖI] Concat với P3 (Index 4) thay vì index 2 cũ
  - [[-1, 4], 1, Concat, [1]]   # 14 cat backbone P3
  - [-1, 1, RepC3, [256]]       # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # 17 cat head P4
  - [-1, 1, RepC3, [512]]       # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]   # 20 cat head P5
  - [-1, 1, RepC3, [1024]]      # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]] # Detect(P3, P4, P5)